# loc와 iloc 구분하기
###  loc은 ‘변수명’을 기준으로 데이터프레임을 분리하고,  iloc은 ‘인덱스번호’로 분류합니다.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20],[21,22,23,24,25]],
                  index=['1st','2nd','3rd','4th','5th'], columns=['A','B','C','D','E'])
df

      A   B   C   D   E
1st   1   2   3   4   5
2nd   6   7   8   9  10
3rd  11  12  13  14  15
4th  16  17  18  19  20
5th  21  22  23  24  25

# loc

### 1. 하나의 row 이름으로 인덱싱하기

In [3]:
df.loc['1st']

A    1
B    2
C    3
D    4
E    5
Name: 1st, dtype: int64

### 2. row 이름의 리스트를 사용하여 인덱싱하기

In [4]:
df.loc[['1st','3rd']]

      A   B   C   D   E
1st   1   2   3   4   5
3rd  11  12  13  14  15

### 3. row 이름의 리스트 슬라이싱

In [5]:
df.loc['1st':'3rd']

      A   B   C   D   E
1st   1   2   3   4   5
2nd   6   7   8   9  10
3rd  11  12  13  14  15

### 3-1) row 이름의 리스트 슬라이싱(단축형태)

In [6]:
df['1st':'3rd']

      A   B   C   D   E
1st   1   2   3   4   5
2nd   6   7   8   9  10
3rd  11  12  13  14  15

### 4. 하나의 column 이름으로 인덱싱하기

In [7]:
df.loc[:, 'A']

1st     1
2nd     6
3rd    11
4th    16
5th    21
Name: A, dtype: int64

### 4-1) 하나의 column 이름으로 인덱싱하기(단축형태)

In [8]:
df['A']

1st     1
2nd     6
3rd    11
4th    16
5th    21
Name: A, dtype: int64

### 5. column 이름의 리스트로 인덱싱하기

In [9]:
df.loc[:, ['A','C','E']]

      A   C   E
1st   1   3   5
2nd   6   8  10
3rd  11  13  15
4th  16  18  20
5th  21  23  25

### 5-1) column 이름의 리스트로 인덱싱하기(단축형태)

In [10]:
df[['A','C','E']]

      A   C   E
1st   1   3   5
2nd   6   8  10
3rd  11  13  15
4th  16  18  20
5th  21  23  25

### 6. column 이름의 리스트 슬라이싱

In [11]:
df.loc[:, 'B':'D']

      B   C   D
1st   2   3   4
2nd   7   8   9
3rd  12  13  14
4th  17  18  19
5th  22  23  24

In [12]:
df

      A   B   C   D   E
1st   1   2   3   4   5
2nd   6   7   8   9  10
3rd  11  12  13  14  15
4th  16  17  18  19  20
5th  21  22  23  24  25

# iloc

### 1. 하나의 row 위치로 인덱싱하기

In [13]:
df.iloc[1]

A     6
B     7
C     8
D     9
E    10
Name: 2nd, dtype: int64

### 2. row 위치의 리스트로 인덱싱하기

In [14]:
df.iloc[[1,3,4]]

      A   B   C   D   E
2nd   6   7   8   9  10
4th  16  17  18  19  20
5th  21  22  23  24  25

### 3. row 위치의 리스트로 슬라이싱하기

In [15]:
df.iloc[2:4]

      A   B   C   D   E
3rd  11  12  13  14  15
4th  16  17  18  19  20

### 3-1) row 위치의 리스트로 슬라이싱하기(단축형태)

In [16]:
df[2:4]

      A   B   C   D   E
3rd  11  12  13  14  15
4th  16  17  18  19  20

### 4. 하나의 column 위치로 인덱싱하기

In [17]:
df.iloc[:,3]

1st     4
2nd     9
3rd    14
4th    19
5th    24
Name: D, dtype: int64

### 5. column 위치의 리스트로 인덱싱하기

In [18]:
df.iloc[:, [1, 3, 4]]

      B   D   E
1st   2   4   5
2nd   7   9  10
3rd  12  14  15
4th  17  19  20
5th  22  24  25

### 6. column 위치의 리스트로 슬라이싱하기

In [19]:
df.iloc[:, 3:5]

      D   E
1st   4   5
2nd   9  10
3rd  14  15
4th  19  20
5th  24  25